wrk-stage-3.txt
++put++

wrk -t4 -c4 -d60s -R1000 -s ./wrk/put.lua --latency http://localhost:8086
Running 1m test @ http://localhost:8086
  4 threads and 4 connections
  Thread calibration: mean lat.: 0.802ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.789ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.807ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.771ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   792.97us  306.13us   5.08ms   60.25%
    Req/Sec   268.98     53.73   333.00     54.55%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  791.00us
 75.000%    1.05ms
 90.000%    1.19ms
 99.000%    1.36ms
 99.900%    2.20ms
 99.990%    2.70ms
 99.999%    5.08ms
100.000%    5.08ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.108     0.000000            1         1.00
       0.387     0.100000         5035         1.11
       0.485     0.200000        10033         1.25
       0.589     0.300000        15044         1.43
       0.691     0.400000        19998         1.67
       0.791     0.500000        25040         2.00
       0.836     0.550000        27558         2.22
       0.882     0.600000        30010         2.50
       0.941     0.650000        32540         2.86
       0.997     0.700000        35028         3.33
       1.048     0.750000        37531         4.00
       1.074     0.775000        38771         4.44
       1.098     0.800000        40043         5.00
       1.121     0.825000        41299         5.71
       1.142     0.850000        42500         6.67
       1.164     0.875000        43763         8.00
       1.175     0.887500        44386         8.89
       1.186     0.900000        45036        10.00
       1.198     0.912500        45643        11.43
       1.211     0.925000        46279        13.33
       1.224     0.937500        46873        16.00
       1.232     0.943750        47202        17.78
       1.241     0.950000        47526        20.00
       1.252     0.956250        47834        22.86
       1.264     0.962500        48143        26.67
       1.278     0.968750        48436        32.00
       1.285     0.971875        48596        35.56
       1.292     0.975000        48766        40.00
       1.302     0.978125        48911        45.71
       1.313     0.981250        49057        53.33
       1.328     0.984375        49221        64.00
       1.336     0.985938        49293        71.11
       1.346     0.987500        49370        80.00
       1.356     0.989062        49448        91.43
       1.369     0.990625        49531       106.67
       1.388     0.992188        49604       128.00
       1.401     0.992969        49649       142.22
       1.412     0.993750        49682       160.00
       1.430     0.994531        49721       182.86
       1.484     0.995313        49760       213.33
       1.556     0.996094        49800       256.00
       1.608     0.996484        49820       284.44
       1.667     0.996875        49838       320.00
       1.735     0.997266        49858       365.71
       1.810     0.997656        49877       426.67
       1.922     0.998047        49897       512.00
       1.984     0.998242        49907       568.89
       2.044     0.998437        49917       640.00
       2.081     0.998633        49926       731.43
       2.143     0.998828        49936       853.33
       2.211     0.999023        49946      1024.00
       2.229     0.999121        49951      1137.78
       2.289     0.999219        49955      1280.00
       2.339     0.999316        49960      1462.86
       2.379     0.999414        49965      1706.67
       2.447     0.999512        49970      2048.00
       2.477     0.999561        49973      2275.56
       2.489     0.999609        49975      2560.00
       2.503     0.999658        49977      2925.71
       2.515     0.999707        49981      3413.33
       2.593     0.999756        49983      4096.00
       2.597     0.999780        49984      4551.11
       2.613     0.999805        49985      5120.00
       2.619     0.999829        49986      5851.43
       2.637     0.999854        49987      6826.67
       2.697     0.999878        49988      8192.00
       2.705     0.999890        49989      9102.22
       2.791     0.999902        49990     10240.00
       2.791     0.999915        49990     11702.86
       3.531     0.999927        49991     13653.33
       3.531     0.999939        49991     16384.00
       4.279     0.999945        49992     18204.44
       4.279     0.999951        49992     20480.00
       4.279     0.999957        49992     23405.71
       4.947     0.999963        49993     27306.67
       4.947     0.999969        49993     32768.00
       4.947     0.999973        49993     36408.89
       4.947     0.999976        49993     40960.00
       4.947     0.999979        49993     46811.43
       5.083     0.999982        49994     54613.33
       5.083     1.000000        49994          inf
#[Mean    =        0.793, StdDeviation   =        0.306]
#[Max     =        5.080, Total count    =        49994]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  60004 requests in 1.00m, 3.83MB read
Requests/sec:   1000.05
Transfer/sec:     65.43KB



wrk -t4 -c4 -d120s -R10000 -s ./wrk/put.lua --latency http://localhost:8086
Running 2m test @ http://localhost:8086
  4 threads and 4 connections
  Thread calibration: mean lat.: 1.242ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.268ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.204ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.169ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.09ms    0.92ms  26.45ms   94.64%
    Req/Sec     2.64k   294.95     8.90k    81.78%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.03ms
 75.000%    1.44ms
 90.000%    1.75ms
 99.000%    2.66ms
 99.900%   14.69ms
 99.990%   22.75ms
 99.999%   25.68ms
100.000%   26.46ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.047     0.000000            1         1.00
       0.311     0.100000       110325         1.11
       0.538     0.200000       220030         1.25
       0.760     0.300000       330414         1.43
       0.912     0.400000       440372         1.67
       1.026     0.500000       550311         2.00
       1.081     0.550000       605302         2.22
       1.138     0.600000       660590         2.50
       1.227     0.650000       715437         2.86
       1.333     0.700000       770459         3.33
       1.437     0.750000       825293         4.00
       1.490     0.775000       852585         4.44
       1.545     0.800000       879960         5.00
       1.598     0.825000       907734         5.71
       1.649     0.850000       935051         6.67
       1.701     0.875000       962945         8.00
       1.727     0.887500       976293         8.89
       1.754     0.900000       990294        10.00
       1.781     0.912500      1003910        11.43
       1.809     0.925000      1017939        13.33
       1.837     0.937500      1031593        16.00
       1.851     0.943750      1038362        17.78
       1.865     0.950000      1045134        20.00
       1.879     0.956250      1051870        22.86
       1.896     0.962500      1058938        26.67
       1.915     0.968750      1065628        32.00
       1.927     0.971875      1069209        35.56
       1.941     0.975000      1072642        40.00
       1.958     0.978125      1075978        45.71
       1.983     0.981250      1079374        53.33
       2.037     0.984375      1082763        64.00
       2.105     0.985938      1084494        71.11
       2.239     0.987500      1086202        80.00
       2.463     0.989062      1087915        91.43
       2.821     0.990625      1089631       106.67
       3.439     0.992188      1091347       128.00
       3.851     0.992969      1092211       142.22
       4.359     0.993750      1093070       160.00
       4.935     0.994531      1093925       182.86
       5.623     0.995313      1094786       213.33
       6.487     0.996094      1095644       256.00
       7.035     0.996484      1096075       284.44
       7.643     0.996875      1096505       320.00
       8.423     0.997266      1096936       365.71
       9.447     0.997656      1097365       426.67
      10.679     0.998047      1097793       512.00
      11.327     0.998242      1098009       568.89
      12.031     0.998437      1098223       640.00
      12.903     0.998633      1098438       731.43
      13.847     0.998828      1098653       853.33
      14.807     0.999023      1098868      1024.00
      15.359     0.999121      1098975      1137.78
      15.887     0.999219      1099082      1280.00
      16.479     0.999316      1099192      1462.86
      17.023     0.999414      1099297      1706.67
      17.647     0.999512      1099403      2048.00
      18.031     0.999561      1099457      2275.56
      18.479     0.999609      1099511      2560.00
      18.975     0.999658      1099565      2925.71
      19.551     0.999707      1099619      3413.33
      20.175     0.999756      1099675      4096.00
      20.495     0.999780      1099699      4551.11
      20.895     0.999805      1099728      5120.00
      21.279     0.999829      1099753      5851.43
      21.743     0.999854      1099780      6826.67
      22.175     0.999878      1099806      8192.00
      22.495     0.999890      1099820      9102.22
      22.799     0.999902      1099834     10240.00
      23.151     0.999915      1099847     11702.86
      23.519     0.999927      1099860     13653.33
      23.919     0.999939      1099873     16384.00
      24.111     0.999945      1099880     18204.44
      24.319     0.999951      1099887     20480.00
      24.591     0.999957      1099895     23405.71
      24.831     0.999963      1099901     27306.67
      24.991     0.999969      1099908     32768.00
      25.103     0.999973      1099910     36408.89
      25.231     0.999976      1099914     40960.00
      25.295     0.999979      1099917     46811.43
      25.407     0.999982      1099920     54613.33
      25.519     0.999985      1099924     65536.00
      25.567     0.999986      1099925     72817.78
      25.599     0.999988      1099927     81920.00
      25.679     0.999989      1099930     93622.86
      25.679     0.999991      1099930    109226.67
      25.775     0.999992      1099932    131072.00
      25.887     0.999993      1099933    145635.56
      25.919     0.999994      1099934    163840.00
      25.951     0.999995      1099935    187245.71
      25.951     0.999995      1099935    218453.33
      26.031     0.999996      1099936    262144.00
      26.127     0.999997      1099937    291271.11
      26.127     0.999997      1099937    327680.00
      26.207     0.999997      1099938    374491.43
      26.207     0.999998      1099938    436906.67
      26.207     0.999998      1099938    524288.00
      26.255     0.999998      1099939    582542.22
      26.255     0.999998      1099939    655360.00
      26.255     0.999999      1099939    748982.86
      26.255     0.999999      1099939    873813.33
      26.255     0.999999      1099939   1048576.00
      26.463     0.999999      1099940   1165084.44
      26.463     1.000000      1099940          inf
#[Mean    =        1.089, StdDeviation   =        0.923]
#[Max     =       26.448, Total count    =      1099940]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1199988 requests in 2.00m, 76.67MB read
Requests/sec:   9999.89
Transfer/sec:    654.29KB



++get++


wrk -t4 -c4 -d60s -R1000 -s ./wrk/get.lua --latency http://localhost:8086
Running 1m test @ http://localhost:8086
  4 threads and 4 connections
  Thread calibration: mean lat.: 0.831ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.805ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.792ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.801ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   809.81us  441.93us  24.43ms   87.12%
    Req/Sec   268.95     54.34   800.00     54.81%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  804.00us
 75.000%    1.05ms
 90.000%    1.21ms
 99.000%    1.36ms
 99.900%    1.89ms
 99.990%   20.40ms
 99.999%   24.45ms
100.000%   24.45ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.158     0.000000            1         1.00
       0.401     0.100000         5005         1.11
       0.503     0.200000        10046         1.25
       0.597     0.300000        15028         1.43
       0.701     0.400000        20022         1.67
       0.804     0.500000        25019         2.00
       0.854     0.550000        27522         2.22
       0.903     0.600000        30032         2.50
       0.951     0.650000        32550         2.86
       1.000     0.700000        35000         3.33
       1.052     0.750000        37498         4.00
       1.078     0.775000        38753         4.44
       1.105     0.800000        40016         5.00
       1.130     0.825000        41263         5.71
       1.157     0.850000        42535         6.67
       1.183     0.875000        43783         8.00
       1.195     0.887500        44375         8.89
       1.208     0.900000        45023        10.00
       1.220     0.912500        45632        11.43
       1.234     0.925000        46266        13.33
       1.247     0.937500        46873        16.00
       1.255     0.943750        47193        17.78
       1.263     0.950000        47532        20.00
       1.271     0.956250        47816        22.86
       1.281     0.962500        48134        26.67
       1.292     0.968750        48440        32.00
       1.298     0.971875        48606        35.56
       1.304     0.975000        48770        40.00
       1.311     0.978125        48914        45.71
       1.320     0.981250        49070        53.33
       1.331     0.984375        49230        64.00
       1.337     0.985938        49297        71.11
       1.343     0.987500        49370        80.00
       1.352     0.989062        49460        91.43
       1.362     0.990625        49533       106.67
       1.372     0.992188        49607       128.00
       1.381     0.992969        49645       142.22
       1.391     0.993750        49684       160.00
       1.403     0.994531        49724       182.86
       1.416     0.995313        49763       213.33
       1.438     0.996094        49799       256.00
       1.456     0.996484        49819       284.44
       1.478     0.996875        49838       320.00
       1.501     0.997266        49858       365.71
       1.546     0.997656        49878       426.67
       1.608     0.998047        49897       512.00
       1.646     0.998242        49907       568.89
       1.698     0.998437        49917       640.00
       1.738     0.998633        49926       731.43
       1.807     0.998828        49936       853.33
       1.910     0.999023        49946      1024.00
       1.934     0.999121        49951      1137.78
       1.987     0.999219        49955      1280.00
       2.167     0.999316        49960      1462.86
       2.357     0.999414        49965      1706.67
       3.931     0.999512        49970      2048.00
       5.071     0.999561        49973      2275.56
       6.871     0.999609        49975      2560.00
       8.879     0.999658        49977      2925.71
      12.079     0.999707        49980      3413.33
      12.871     0.999756        49982      4096.00
      15.975     0.999780        49984      4551.11
      16.591     0.999805        49985      5120.00
      16.687     0.999829        49986      5851.43
      18.591     0.999854        49987      6826.67
      19.871     0.999878        49988      8192.00
      20.399     0.999890        49989      9102.22
      20.575     0.999902        49990     10240.00
      20.575     0.999915        49990     11702.86
      22.367     0.999927        49991     13653.33
      22.367     0.999939        49991     16384.00
      23.743     0.999945        49992     18204.44
      23.743     0.999951        49992     20480.00
      23.743     0.999957        49992     23405.71
      24.255     0.999963        49993     27306.67
      24.255     0.999969        49993     32768.00
      24.255     0.999973        49993     36408.89
      24.255     0.999976        49993     40960.00
      24.255     0.999979        49993     46811.43
      24.447     0.999982        49994     54613.33
      24.447     1.000000        49994          inf
#[Mean    =        0.810, StdDeviation   =        0.442]
#[Max     =       24.432, Total count    =        49994]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  60004 requests in 1.00m, 4.10MB read
Requests/sec:   1000.05
Transfer/sec:     69.92KB

wrk -t4 -c4 -d120s -R10000 -s ./wrk/get.lua --latency http://localhost:8086
Running 2m test @ http://localhost:8086
  4 threads and 4 connections
  Thread calibration: mean lat.: 1.149ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.209ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.220ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.097ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.76ms    5.22ms 100.29ms   97.11%
    Req/Sec     2.64k   335.61     5.33k    76.13%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.01ms
 75.000%    1.46ms
 90.000%    1.89ms
 99.000%   23.85ms
 99.900%   71.23ms
 99.990%   94.65ms
 99.999%   99.78ms
100.000%  100.35ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.049     0.000000            1         1.00
       0.319     0.100000       110182         1.11
       0.520     0.200000       220331         1.25
       0.707     0.300000       330290         1.43
       0.876     0.400000       440424         1.67
       1.009     0.500000       550707         2.00
       1.067     0.550000       605176         2.22
       1.127     0.600000       659979         2.50
       1.205     0.650000       715481         2.86
       1.327     0.700000       770328         3.33
       1.457     0.750000       825348         4.00
       1.525     0.775000       852670         4.44
       1.597     0.800000       880011         5.00
       1.666     0.825000       907682         5.71
       1.737     0.850000       935082         6.67
       1.811     0.875000       962792         8.00
       1.849     0.887500       976454         8.89
       1.889     0.900000       990083        10.00
       1.938     0.912500      1003844        11.43
       1.999     0.925000      1017560        13.33
       2.175     0.937500      1031250        16.00
       2.455     0.943750      1038101        17.78
       2.899     0.950000      1044972        20.00
       3.551     0.956250      1051841        22.86
       4.551     0.962500      1058711        26.67
       6.187     0.968750      1065585        32.00
       7.295     0.971875      1069021        35.56
       8.743     0.975000      1072461        40.00
      10.487     0.978125      1075890        45.71
      12.639     0.981250      1079329        53.33
      15.679     0.984375      1082764        64.00
      17.519     0.985938      1084484        71.11
      19.695     0.987500      1086212        80.00
      21.823     0.989062      1087924        91.43
      25.519     0.990625      1089638       106.67
      30.175     0.992188      1091357       128.00
      32.639     0.992969      1092217       142.22
      36.255     0.993750      1093084       160.00
      39.807     0.994531      1093940       182.86
      43.775     0.995313      1094801       213.33
      49.247     0.996094      1095655       256.00
      51.743     0.996484      1096084       284.44
      55.295     0.996875      1096514       320.00
      57.279     0.997266      1096943       365.71
      59.583     0.997656      1097378       426.67
      62.015     0.998047      1097808       512.00
      63.071     0.998242      1098019       568.89
      64.287     0.998437      1098233       640.00
      65.375     0.998633      1098450       731.43
      67.071     0.998828      1098661       853.33
      72.319     0.999023      1098880      1024.00
      74.687     0.999121      1098985      1137.78
      79.423     0.999219      1099092      1280.00
      82.495     0.999316      1099201      1462.86
      84.671     0.999414      1099306      1706.67
      86.463     0.999512      1099417      2048.00
      87.231     0.999561      1099469      2275.56
      87.935     0.999609      1099522      2560.00
      88.895     0.999658      1099575      2925.71
      90.047     0.999707      1099632      3413.33
      90.943     0.999756      1099689      4096.00
      91.327     0.999780      1099710      4551.11
      92.031     0.999805      1099736      5120.00
      92.543     0.999829      1099768      5851.43
      92.735     0.999854      1099791      6826.67
      93.439     0.999878      1099816      8192.00
      94.271     0.999890      1099830      9102.22
      94.783     0.999902      1099844     10240.00
      95.807     0.999915      1099857     11702.86
      96.447     0.999927      1099870     13653.33
      96.895     0.999939      1099885     16384.00
      97.215     0.999945      1099891     18204.44
      97.727     0.999951      1099898     20480.00
      98.623     0.999957      1099904     23405.71
      98.815     0.999963      1099911     27306.67
      98.943     0.999969      1099917     32768.00
      99.135     0.999973      1099924     36408.89
      99.135     0.999976      1099924     40960.00
      99.263     0.999979      1099928     46811.43
      99.327     0.999982      1099930     54613.33
      99.391     0.999985      1099934     65536.00
      99.519     0.999986      1099936     72817.78
      99.583     0.999988      1099937     81920.00
      99.775     0.999989      1099940     93622.86
      99.775     0.999991      1099940    109226.67
      99.839     0.999992      1099942    131072.00
      99.903     0.999993      1099943    145635.56
      99.967     0.999994      1099944    163840.00
     100.095     0.999995      1099947    187245.71
     100.095     0.999995      1099947    218453.33
     100.095     0.999996      1099947    262144.00
     100.095     0.999997      1099947    291271.11
     100.095     0.999997      1099947    327680.00
     100.223     0.999997      1099948    374491.43
     100.223     0.999998      1099948    436906.67
     100.223     0.999998      1099948    524288.00
     100.287     0.999998      1099949    582542.22
     100.287     0.999998      1099949    655360.00
     100.287     0.999999      1099949    748982.86
     100.287     0.999999      1099949    873813.33
     100.287     0.999999      1099949   1048576.00
     100.351     0.999999      1099950   1165084.44
     100.351     1.000000      1099950          inf
#[Mean    =        1.760, StdDeviation   =        5.224]
#[Max     =      100.288, Total count    =      1099950]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1199985 requests in 2.00m, 92.93MB read
  Non-2xx or 3xx responses: 879216
Requests/sec:   9999.95
Transfer/sec:    793.03KB